/**
  Дана переменная str, 
 в которой хранится какой-либо текст. 
 Реализуйте обрезание длинного текста по следующему принципу: 
 если количество символов этого текста больше заданного в переменной n, 
 то в переменную result запишем первые n символов строки str
  и добавим в конец троеточие '...'. 
  В противном случае в переменную result запишем содержимое переменной str.
 */
// const str = 'я учу javascript!';
// console.log(str);
// const n = 7;

// let result = '';
// console.log(str.length);
// if (str.length > n) {
//   result = str.substr(0, n) + '...';
// } else {
//   result = str;
// }
// console.log(result);

/**
 * Дана строка 'Я-учу-javascript!'.
 *  Замените все дефисы на '!' с помощью глобального поиска и замены.
 */
